app/controllers/welcomes_controller.rb

SELECT "welcomes".* FROM "welcomes"
---
  def index
    @welcomes = Welcome.all